AccumulationRegisters/ТоварыНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладе</Name>
			<Comment>Задчача №13492</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПродажиПоМенеджерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоМенеджерам</Name>
			<Comment>Задчача №13496</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<Comment>Задчача №13492</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ФормаДашборда/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.Вариант = ВариантСтандартногоПериода.ЭтотГод;
	ОбновитьДиаграммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьДиаграммыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДиаграммыНаСервере();
КонецПроцедуры 
		
#КонецОбласти 
	
#Область СлужебныеПрооцедурыИФункции
	
&НаСервере
Процедура ОбновитьДиаграммыНаСервере()
	
	ОбновитьДиаграммуЗаказыПоМесяцам();
	ОбновитьДиаграммуПродажиПоКонтрагентам();
	ОбновитьДиаграммуДинамикаПродаж();
	ОбновитьДиаграммуПродажиПоМенеджерам();	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуЗаказыПоМесяцам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Реализация.Ссылка) КАК КоличествоЗаказов,
		|	НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ) КАК Месяц
		|ИЗ
		|	Документ.Реализация КАК Реализация
		|ГДЕ
		|	Реализация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Реализация.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Реализация.Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	ДанныеПоЗаказам = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеПоЗаказам.Вставить(Выборка.Месяц, Выборка.КоличествоЗаказов);
	КонецЦикла;
	
	ЗаказыПоМесям.Очистить();
	Серия = ЗаказыПоМесям.УстановитьСерию("Количество заказов");
	
	Месяц = Период.ДатаНачала;
	
	Пока Месяц <= Период.ДатаОкончания Цикл
		
		Точка = ЗаказыПоМесям.УстановитьТочку(Месяц);
		Точка.Текст = Формат(Месяц, "ДФ='MMMM yyyy'");
		
		КоличествоЗаказов = ?(ДанныеПоЗаказам[Месяц] <> Неопределено, ДанныеПоЗаказам[Месяц], 0);
		
		ЗаказыПоМесям.УстановитьЗначение(Точка, Серия, КоличествоЗаказов);
		
		Месяц = ДобавитьМесяц(Месяц, 1);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуДинамикаПродаж()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладеОбороты.Период КАК Период,
		|	ТоварыНаСкладеОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ТоварыНаСкладеОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(СуммаОборот)
		|ПО
		|	Период ПЕРИОДАМИ(МЕСЯЦ, &НачалоПериода, &КонецПериода)";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПериод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");
		
	ДинамикаПродаж.Очистить();
	Серия = ДинамикаПродаж.УстановитьСерию("Сумма продаж");
	
	Пока ВыборкаПериод.Следующий() Цикл
		
		Точка = ДинамикаПродаж.УстановитьТочку(ВыборкаПериод.Период);
		Точка.Текст = Формат(ВыборкаПериод.Период, "ДФ='MMMM yyyy'");
		
		ДинамикаПродаж.УстановитьЗначение(Точка, Серия, ВыборкаПериод.СуммаОборот);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуПродажиПоМенеджерам()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиПоМенеджерамОбороты.Менеджер КАК Менеджер,
		|	ПродажиПоМенеджерамОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.ПродажиПоМенеджерам.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиПоМенеджерамОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПродажиПоМенеджерам.Очистить();
	Точка = ПродажиПоМенеджерам.УстановитьТочку("Сумма продаж");
	
	Пока Выборка.Следующий() Цикл
		
		Серия = ПродажиПоМенеджерам.УстановитьСерию(Выборка.Менеджер);
		
		ПродажиПоМенеджерам.УстановитьЗначение(Точка, Серия, Выборка.СуммаОборот);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуПродажиПоКонтрагентам()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладеОбороты.Контрагент КАК Контрагент,
		|	ТоварыНаСкладеОбороты.СуммаРасход КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладе.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ТоварыНаСкладеОбороты";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПродажиПоКонтрагентам.Очистить();
	Точка = ПродажиПоКонтрагентам.УстановитьТочку("Сумма продаж");
	
	Пока Выборка.Следующий() Цикл
		
		Серия = ПродажиПоКонтрагентам.УстановитьСерию(Выборка.Контрагент);
		ПродажиПоКонтрагентам.УстановитьЗначение(Точка, Серия, Выборка.Сумма);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
